[{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Taylor Lyles", "title": "Here’s where you can buy a PS5", "description": "The PlayStation 5 is one of the most difficult consoles to buy right now because of the pandemic. We’re keeping an eye on retailers like Amazon, Best Buy, Walmart, and others to help you find and buy Sony’s next-gen console.", "url": "https://www.theverge.com/22323257/sony-playstation-5-ps5-in-stock-digital-disk-edition-where-buy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/nLhwP1T-any8xLO0yYL1NUQONXc=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21990370/vpavic_4261_20201023_0058.jpg", "publishedAt": "2021-03-12T20:55:30Z", "content": "Update March 18th, 2021 2:50PM ET: Walmart is restocking both the PS5 and PS5 Digital Edition today at 3PM ET, while supplies last. Related The PlayStation 5 has been quite challenging to find ever since its launch in November. And when it is available, sales have been, for the most part, limited to online-only, with stock selling out almost instantly. Despite this, we here at The Verge are dedicated to helping you keep track of when and where the PS5 is available in the hopes you can get another shot at buying Sony’s next-gen console. We’re keeping a lookout across the web to find where, when, and how you can buy either the PS5 (with a disc drive) or the PS5 Digital Edition, as well as any bundles that are not price surged. Keep in mind that due to the high demand of this console, supply will not last long, with inventory selling out typically less than an hour after being made available. Nevertheless, we’ll do our best to keep this article updated with the latest in-stock alerts and tell you when the most recent restock was available at the retailers selling the console. Related Due to the pandemic, most retailers, including Best Buy and Target, will only sell the console online until further notice. We see restocks happening multiple times in the week from various retailers; most notably, we have seen frequent restocks recently appear at Best Buy, GameStop, Target, and Walmart in particular. If you are looking for a bundle, retailers like Antonline and Newegg are likely to sell PS5 bundles instead of the actual console. We have noticed that restocks for the console are more likely to happen later in the week as opposed to earlier in the week. Additionally, places like Newegg are combatting the demand for this console by doing a Newegg Shuffle, which randomly selects winners interested in buying sought-after products. Prices taken at time of publishing. The PS5 Digital Edition costs $399. Compared to the PS5, this console is $100 less and does not include a Blu-ray disc drive. Prices taken at time of publishing. Sony’s flagship next-gen console, which includes a disc drive, allowing you to play both digital and physical games on the PS4 and PS5. The PS5 includes all the basic things you need to get started (minus the games, of course). However, you might want to consider picking up additional accessories to ensure you get the most out of your brand-new console. First, there’s the controller. Every new PS5 includes one DualSense controller. But there are a few benefits to owning at least one additional controller, such as if you plan to play local co-op games with a friend or family member. Or, if you are like me and want to keep playing your game but don’t want to be tethered to the charging cable, a second control lets you continue playing while the other one charges. Normally, $70, we have seen the controller go down as low as $60. Prices taken at time of publishing. The controller designed for the PS5, featuring adaptive triggers, a built-in microphone, and haptic feedback technologies. The PS5 HD Camera is a neat accessory for people interested in using their PS5 to live-stream video games or broadcast their gameplay with friends.  It includes dual 1080p lenses and allows you to remove the background of your camera’s feed and replace it with something else. Prices taken at time of publishing. A successor to the PS4 camera that allows players to stream footage directly from their PS5 console. I strongly recommend subscribing to PlayStation Plus if you have not already done so; outside of taking advantage of some online gaming functionalities, PlayStation Plus provides a ton of additional incentives, most notably PS5 owners have access to the PlayStation Plus Collection, a digital library of some of the most impactful titles to release on the PS4. Prices taken at time of publishing. PlayStation Plus allows PS4 and PS5 gamers to play games online and receive free games each month along with discounts on the PS Store. The PS5 comes with a 825GB of available storage right now and unfortunately, there’s no way to expand the fast internal storage currently. Sony is reportedly expanding the options for more SSD storage. If you want to store some older PS4 titles on your console so you don’t use your limited SSD storage, I strongly advise buying an external hard drive to store those titles. Prices taken at time of publishing. A 4TB external hard drive that is ideal for storing PS4 games, if you are planning to play these titles on the PS5 and do not want to sacrifice SSD space on the console. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Barbara Krasnoff", "title": "Bitwarden adds secure text and file transfer to its arsenal", "description": "Bitwarden has a new feature it calls Send, which allows you to send files or text (including, if you wish, passwords) securely via end-to-end AES-256 bit encryption.", "url": "https://www.theverge.com/2021/3/12/22327834/bitwarden-secure-text-file-transfer-encryption", "urlToImage": "https://cdn.vox-cdn.com/thumbor/VNr1XaAwBiDcD90HIuDXuvYPUHY=/0x114:2312x1324/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22366286/Screen_Shot_2021_03_12_at_2.23.19_PM.png", "publishedAt": "2021-03-12T21:18:30Z", "content": "Many current password managers allow you to share your passwords with family members or other individuals or groups. (You do use a password manager, don’t you?) Managers such as Bitwarden and 1Password have specific methods by which you can share passwords or groups of passwords, making it easier for a family to, say, access a shared streaming service. Now Bitwarden has upped the ante by adding a feature it calls Send, which allows you to send files or text (including, if you wish, passwords) securely via end-to-end AES-256 bit encryption, using a link on its site. Here’s how it works: If you wish to send a file (it can be up to 100 MB), you go to Bitwarden’s website and click on the Send button. After you upload the file, or create a text message, Send will generate a link that you can send out via email, text, or any other method you choose. When the person you send it to clicks on the link (and they don’t have to be a registered Bitwarden user), they are sent to a page where they can either view the text message or download the file. But before you send out the link, there are a number of security features you can add. You can set a date and time for the file to automatically be deleted from the linked page (in other words, if you click on the link after that, you’ll be informed it’s no longer available) or for the link to expire. You can limit the number of times the file can be accessed and you can see how many times it’s been accessed so far. And finally, you can set a password for the link. If you’re using Send to create a text message, you can also have it be hidden by default when it is accessed (so the text is not immediately readable). Related The new Send feature will be only partially available to Bitwarden’s free users. Members with free accounts will be able to use it to send text, but not files, while those with Premium and other paid memberships will be able to send both text and files. Bitwarden is obviously taking full advantage of the recent reported exodus from LastPass because of the latter’s new limitations on its free accounts. Since there are already a number of free services for sending encrypted files, such as WeTransfer, and since having a secure way to send information such as passwords, personal information, and account numbers can be very handy, it looks like Bitwarden has given people another good reason to switch from LastPass. The new Send feature should be available Monday, March 15th at 7 AM. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Bumble’s new Night In feature is an attempt to break the ice on virtual dates", "description": "Bumble has announced Night In, a new feature that gives users a game to play on a virtual date. It’s available in the US and Canada, and at first, the game will consist of trivia questions you can answer with your date.", "url": "https://www.theverge.com/2021/3/11/22325404/bumble-virtual-date-trivia-quiz-social-distancing", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YBf1WmTmRvZPnYiz2YFxX8BYXTA=/0x63:1920x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22362827/Night_In_Press_w_logo.png", "publishedAt": "2021-03-11T17:04:33Z", "content": "Dating app Bumble has announced Night In, a new feature that lets you play games on a virtual date. The feature is available to users in the US and Canada, and the game available at launch is a series of trivia questions you can answer together. However, Bumble says it plans to offer more games and virtual experiences in the “near future.” Night In is an expansion of Bumble’s existing video dates feature, which it launched back in 2019. The feature has seen a marked increase in demand as a result of the pandemic; Bumble says its voice and video calling features were used 70 percent more after the pandemic started. Hopefully, being able to play a game will act as a nice icebreaker and help mitigate some of the more awkward elements of virtual dates, even if they’ll never match the intimacy of being in the same room as another person. Bumble’s Night In can be organized using the icon in a chat message. The virtual date can be scheduled ahead of time for between 6PM and midnight on any day of the week. Once scheduled, both participants will be sent reminders and notifications by the app ahead of the date. Bumble’s video chat features were in place before the pandemic, but other dating apps like Tinder and Hinge have had to rush to catch up over the past year. Although the introduction of these features was undoubtedly influenced by the pandemic, it sounds like they might live on after this current era of social distancing. In a recent survey, Bumble says almost half of respondents in the US said they preferred a first date to be virtual rather than in person.   "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Bijan Stephen", "title": "Soon you’ll be able to buy a one-foot-tall figurine of ChilledCow’s lo-fi chill beats anime girl", "description": "The figurine comes with her desk, her homework, her backpack, and more. It goes on sale on April 2nd at 3PM ET.", "url": "https://www.theverge.com/tldr/2021/3/11/22325348/youtooz-lofi-chill-anime-beats-chilled-cow-figurine", "urlToImage": "https://cdn.vox-cdn.com/thumbor/G9mDrFFYL5ADHB5t379D7pJlZEM=/0x108:1500x893/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22362814/youtooz_lofi_hip_hop_radio_beats_to_relax_study_to_girl_1_ft_figure_release_info_2.jpg", "publishedAt": "2021-03-11T16:46:11Z", "content": "Jesus. Okay. Look, I like capitalism as much as the next schmuck who blogs for a living, but what is going on right now with regard to the efficient allocation of the Earth’s precious resources? Let me paint a word picture for you. Youtooz, the company that made a stonks guy figurine, has now created a one-foot-tall version of the lo-fi chill beats anime girl, complete with desk and study materials. You know her; she’s always studying while you’re listening to said beats. According to Hypebeast, the figurine drops for public consumption on April 2nd at 3PM ET. In theory, I like whatever’s going on here. Before it became something of a meme, lo-fi chill anime beats to work and study to was an inaccurate description of the post-Nujabes diaspora — you know, the stuff that Jun Seba did on Samurai Champloo Music Record: Departure, the soundtrack to Shinichirō Watanabe’s brilliant anime. Whatever happened between 2004 (when the TV show and the record were released) and now must have been pretty traumatic; the sound wended its way through innumerable producers and turned into something like Muzak — music to be productive to. Anyway, we’re in the deep end now. Over on YouTube, ChilledCow is probably the most recognizable channel for lo-fi goodness, streaming as they do to tens of thousands of listeners at any given minute on any given day. And yes, Youtooz’s figurine is a replica of their perpetually studying anime girl. It looks cool; she has a backpack. But that still doesn’t answer my question. I guess it doesn’t matter? I do love the statuette, but I’m not sure it needs to exist. Whatever. Do Canti from FLCL next, cowards. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Tens of thousands of Verkada cameras were easily accessible to employees as well as hackers", "description": "Surveillance company Verkada, which recently suffered a breach exposing some 150,000 of its cameras to hackers, also gave employees widespread access to the same feeds. New reports says more than 100 employees had “super admin” privileges, and that oversight …", "url": "https://www.theverge.com/2021/3/11/22324876/surveillance-camera-firm-verkada-breached-hacked-super-admin-access-employees", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fa5LNW-tt3pfRJPenkd4s8dBqZ4=/0x571:7952x4734/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22362280/Verkada_Camera_Outdoor2.jpg", "publishedAt": "2021-03-11T10:53:16Z", "content": "Employees of cloud-based surveillance firm Verkada had widespread access to feeds from customers’ cameras, according to new reports from Bloomberg and The Washington Post. Verkada’s systems were recently breached by a “hacktivist” collective which gained access to more than 150,000 of the company’s cameras in locations ranging from Tesla factories, to police stations, gyms, schools, jails, and hospitals. The group, who call themselves Advanced Persistent Threat 69420, stumbled across log-in credentials for Verkada’s “Super Admin” accounts online. They publicized their findings, saying they were motivated by “lots of curiosity, fighting for freedom of information and against intellectual property, a huge dose of anti-capitalism, a hint of anarchism — and it’s also just too much fun not to do it.” Now, anonymous Verkada employees say the same “Super Admin” accounts that the hackers accessed were also widely shared in the company itself. More than 100 employees had Super Admin privileges, reports Bloomberg, meaning that these individuals could browse the live feeds from tens of thousands of cameras around the world at any time. “We literally had 20-year-old interns that had access to over 100,000 cameras and could view all of their feeds globally,” one former senior-level employee told the publication. Verkada, meanwhile, says access was limited to employees who needed to fix technical problems or address user complaints. “Verkada’s training program and policies for employees are both clear that support staff members were and are required to secure a customer’s explicit permission before accessing that customer’s video feed,” said the Silicon Valley firm in a statement given to Bloomberg. The Washington Post, though, cites the testimony of surveillance researcher Charles Rollet, who says individuals with close knowledge of the company told him that Verkada employees could access feeds without customers’ knowledge. “People don’t realize what happens on the back-end, and they assume that there are always these super-formal processes when it comes to accessing footage, and that the company will always need to give explicit consent,” said Rollet. But clearly that’s not always the case.” Another former employee told Bloomberg that although Verkada’s internal systems asked workers to explain why they were accessing a customer’s camera, this documentation was not taken seriously. “Nobody cared about checking the logs,” said the employee. “You could put whatever you wanted in that note; you could even just enter a single space.” Verkada’s cloud-based cameras were sold to customers in part on the strength of their analytical software. One feature called “People Analytics” let customers “search and filter based on many different attributes, including gender traits, clothing color, and even a person’s face,” said Verkada in a blog post. Their cloud-based systems that gave customers’ easy access to their camera’s feeds also enabled the breach. The hacker collective Advanced Persistent Threat 69420 (the name is a nod to the taxonomy used by cybersecurity companies to catalog state-sponsored hackers combined with the meme numbers 69 and 420) say they wanted to inform the public of the dangers of such ubiquitous surveillance. The breach “exposes just how broadly we’re being surveilled, and how little care is put into at least securing the platforms used to do so, pursuing nothing but profit,” one member of the group told Bloomberg. “It’s just wild how I can just see the things we always knew are happening, but we never got to see.” "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Spotify lets passengers fight over your road trip playlist, disturbing natural order of universe", "description": "The Polestar 2 is debuting Spotify’s Group Sessions feature, letting anyone in the car help DJ your next road trip — in stark violation of the rule that the driver always gets to pick the music.", "url": "https://www.theverge.com/2021/3/11/22325579/spotify-group-sessions-polestar-2-android-automotive-car", "urlToImage": "https://cdn.vox-cdn.com/thumbor/hBxKwkl3QrpyqrKnE4hYf5L2Obk=/0x611:5000x3229/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21857160/Polestar2_US_Launch_0027.jpg", "publishedAt": "2021-03-11T18:54:46Z", "content": "It’s a fundamental rule of the road: driver picks the music. And yet, in a brazen challenge to the immutable laws of the universe, Spotify has chosen to meddle with this golden rule by expanding its Group Session beta to cars. Starting today, up to six people in the car can all control music at the same time, starting with the Android Automotive-powered Polestar 2. “We all know that sometimes the driver doesn’t have the best taste in music and my family tends to agree. The addition of Group Sessions Beta from Spotify is a great way for others in the vehicle to influence the playlist and enjoy their favorite tracks,” commented Polestar CEO Thomas Ingenlath, a man who clearly cannot be trusted with playlist powers. Group Session rolled out last year as a beta and is limited to Spotify premium subscribers; once a host starts a session, up to five other users can join, giving them full (shared) control over the playlist and the power to play, pause, and skip tracks at will. And sure, it’s a useful feature when you’re hanging out with friends in the low-stakes environments of a barbecue or a dinner party. Fortunately, there are safeguards: the driver will still apparently have the power to revoke access at any time (because, again, driver picks the music!). But when it comes the delicate balance of an hourslong road trip, Spotify is still playing with fire here. Do you really want to risk your friend bombarding you with Nickelback songs every other track for the entire drive to Pittsburgh? That said, the potential descent into carpool chaos is limited, for now. The expanded Group Session beta is only available in the Polestar 2 — currently the only car on the market that runs Android Automotive — but presumably, as Google’s smart car platform continues to arrive on more cars in the future, it’ll be more broadly available. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nicole Wetsman", "title": "One year later", "description": "The COVID-19 pandemic took over the United States a year ago, on March 11th, 2020. The Verge staff shared their memories from the time when everything changed.", "url": "https://www.theverge.com/2021/3/11/22325333/covid-pandemic-one-year-later-march-pandemic", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_oMoJ6JStsbnkS-7T3Hx2uLNhdc=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22363272/VRG_ILLO_4468_001.jpg", "publishedAt": "2021-03-11T19:08:59Z", "content": "The calendar tells me that it’s been a year since the world changed. It’s been more than a year, really: the first COVID-19 case in the United States was reported on January 21st, 2020. The emergency was invisibly building in the US even before that. But a year ago today, the scale of the threat was pushed into view, and the outbreak became a pandemic. It’s hard to recapture the specific feelings of last March. There was a particular mixture of confusion, fear, numbness, and denial hanging in the background of everything, and most of the month was a blur. But within that miasma of badness, specific moments stand out. Those vivid signposts are the things I remember most clearly when I think back to a year ago: a de-stressing collage I made from old magazines, a miniature bottle of hand sanitizer, a specific trip to the bagel shop, the things I panic-bought on Amazon. Everyone has their own unique markers of the days when things changed. I asked The Verge staff to share theirs. Luckily, there are brighter days ahead. My favorite relic of the first weeks of the pandemic is the 76.5-ounce canister of lemon-lime Gatorade powder I bought on Amazon. Everything was so scary and so new, and my instinct was to get everything I might need if I (or someone I knew) got sick. Enough powder to make nine gallons of Gatorade seemed reasonable at the time. I’ve used around half of it in the past year; it was particularly useful during election week when I was too anxious for solid food. Now, the canister lives on the top of my fridge, and I’m very attached to it. It feels like the strangest-possible pandemic security blanket.  —Nicole Wetsman When masks first became a thing, disposable masks weren’t available because they were needed by first responders and hospital workers. I remember being grateful that I already had a couple of reusable face masks leftover from when we had to have some exterminators come the year before. But I didn’t know if those two would last, and you couldn’t find any to buy, so I did some research, asked some of the other Verge folks what they were doing, and hand-sewed a rather neat little mask from an old bedsheet (which I ended up never actually using). I remember several friends with sewing machines were sewing face masks to send to hospitals because the demand was so huge that medical personnel were running short, and cloth masks were better than none at all. The other hard-to-get pandemic item was hand sanitizer. Again, it was simply not available, and I researched what you had to use to make your own, including what kind of alcohol and what strength it had to be. (I actually ended up writing an article about it.) I managed to score the aloe vera gel I needed at a local health food store but was never able to get the alcohol at the strength demanded — by the time it was available, I was able to purchase hand sanitizer at my local supermarket anyway. There must be something I can do with that aloe vera gel… —Barbara Krasnoff I made a panicked trip to the grocery store about the same time as everyone else in Seattle when we realized what was going on. It was chaos — so many confused people, none of us sure what we were supposed to be doing or buying. All of the good brands of oat milk were cleared off the shelves. I put two frozen pizzas on the bottom of my shopping cart. I remember a sense of comfort, like, “Yes, this additional frozen pizza will see us through the deadly pandemic.” When I got to the front of the massive checkout line, there was only one pizza — the other one fell off at some point. RIP that other frozen pizza, abandoned on the floor of a Safeway in March 2020. You were sorely missed.  —Allison Johnson Ah yes, I feel confident that this *bottle of Purell zip-tied to a pole* will keep my workplace free of the coronavirus pic.twitter.com/PeDFJ75THI New York City, as everyone knows, was one of the first hotspots for COVID-19 in the US. The early stages of the pandemic were all about trying to convey our experience, and the importance of believing science and taking precautions, to family members who weren’t impacted yet in other parts of the country. It was — and continues to be — an incredibly frustrating experience trying to relay info to loved ones who still hold on to the “it couldn’t happen to me” line of thinking. I’m so glad it hasn’t happened to them, but it so easily could have. Oh, and it was really hard to find toilet paper there for a while. Bidet all day.  —Cameron Faulkner Two days stand out for when the pandemic became “real” to me. On February 29th, one day after the first reported case of COVID-19 in Oregon, I woke up and asked my wife if we should buy extra food at the grocery store. I wondered if that would be a weird or over-reactionary thing to do. (Who knew that I should have actually been asking about buying extra toilet paper.) On March 11th, there was the weird double-whammy of the NBA cancelling its season and Tom Hanks and Rita Wilson announcing their COVID-19 diagnoses. After that day, it seemed like everyone talked about COVID-19 a little differently. A year on, I’m glad that many are now vaccinated and that hopefully soon, many more will be. But I also wonder how we’ll all be irrevocably changed from our time in the pandemic. — Jay Peters By the time the WHO made the official call that we were in a pandemic, the swirling fear and unrelenting news had already started messing with our heads. Just a few weeks into living and working at home, and we started to lose track of what day of the week it was. My family would sit down for dinner, look at each other, and try to remember if we’d just finished our Thursday zoom meetings or if it was only Tuesday. Eventually, we started raising a glass to the day of the week. “Monday?” “Monday.” <clink> We still do it every night.  —Mary Beth Griggs On March 10th, I took a selfie with a woman who had fallen asleep on me during my commute home. I joked that “social distancing in NYC is going great!” The next day, I showed up to the office and only a handful of my colleagues were in, but all of the snacks were gone. I had a few bags of chips stowed away at my desk, and I used chopsticks to eat them because I was afraid of touching my mouth.  —Cory Zapatka I distinctly remember taking the dog for an early morning walk around this time last year and being shocked that there were no cars — literally none — on what’s usually a very traffick-y road into Downtown Pittsburgh. It was eerily quiet, and it was the first time it hit home for me how huge the situation really was. Now, whenever I venture out in the car, the lack of traffic is actually really nice, if still a bit disconcerting. I’m hopeful this might make us rethink our dependence on cars, but I think it’s too early to tell whether the lack of traffic will become a permanent result of the pandemic.  —Kim Lyons “Today is Thursday” was trending on Twitter on March 19th, and several Verge staffers started musing about how an automated reminder of what day of the week it was would be nice. A bit of tinkering and a few hours later, and @TodaysDayToday was born: a Twitter account that, once a day, at 9AM ET, tweets what day of the week it is. Is it a useful Twitter account? Not exactly, but I do find it strangely comforting to see each morning, even a year later. And despite the timeless, WFH pandemic void, some things never changed: people still love Fridays and dread Mondays, if replies to the bot are anything to go by. One year later, and time keeps on moving forward. Things might almost start looking like normal again soon. But my little Twitter bot will still keep ticking on, too. And in case you were wondering: today is Thursday.  —Chaim Gartenberg Today is Thursday. At the very beginning of the pandemic, our entire family had COVID and didn’t know it. My husband had gotten a false positive flu test, I spent about three weeks in bed with exhaustion and low appetite, our older son had fever and chills for two days, and our daughter had a fever for a morning that never returned after taking Motrin. But there were no tests around and nothing to do about it. And the positive flu test gave us hope. Then one day, as I was cleaning the bathroom, I wasn’t able to smell the Clorox. My husband who has year-round allergies and can never smell couldn’t help me. Our housekeeper who hadn’t been there in over three weeks assured me that the bleach was not watered down. But no matter how much I sniffed, I could not smell the faintest trace of bleach. I felt like I was losing my mind. I finally decided to spray my clothes, and, alas, within seconds they were covered in bleach stains. Not long after, reports came out about COVID’s effects relating to loss of smell and taste. Antibody tests confirmed we had had it, but the memory of me frantically running around our apartment spraying myself with bleach will stay with us forever.  —Esther Cohen 2020 was going to be my first year living on my own, and the newfound independence was exhilarating. Then March came roaring in with a pandemic that trapped me in my apartment. At the beginning of the month, when the pandemic was still mostly just an ominous cloud on the horizon, I stumbled across the most precious dog online. Her name was Trudee. I had been wanting a dog for months, so I put in an application to the local rescue. After several interviews, I was approved to adopt her. On March 17th, I drove from Columbus to Cleveland to pick her up. The highways were unusually empty. On March 18th, Ohio’s governor began to shut down businesses across the state. It was when this call came that I realized I was facing weeks or even months of loneliness in this apartment I was once so excited to be in. I remember hanging my head and crying out of fear of the isolation inside and the deadly disease outside. Trudee, however, was my saving grace. She kept the loneliness at bay, and we’ve been inseparable since.  —Kaitlin Hatton The pandemic’s start was actually supposed to be one of the coolest work trips of my career: a super-secret visit to Seattle, where I would play Valve’s then-upcoming Half-Life: Alyx. Valve wisely canceled the trip and let reporters play Alyx at home instead, and within a few days, I was in self-quarantine at the virus epicenter in New York City after an employee at Vox’s offices tested positive for COVID-19. The result is that I spent the early pandemic locked inside my apartment with a giant batch of mushy homemade enchiladas, wearing a VR headset I brought home on my very last trip from our office, trying to write something that sounded like a normal review for a major video game franchise instead of a panicky dispatch from a plague exclusion zone. It’s the only time I’ve ever introduced a developer interview by casually mentioning the local disease death toll. (I guess it was 125 back then, which is heartbreakingly low in retrospect since, within weeks, the city would watch bodies pile up in freezers and a mass grave.) I rewrote the opening paragraph to that article about 50 times, and that was the least dramatic version I came up with. Because outside VR, all I remember is grief and fury. Spending every night listening to ambulances flood the local hospital, waking up to smug pundits and politicians insisting the pandemic wasn’t real, mocking New Yorkers for being afraid of a disease nobody could cure or understand. Worrying a vicious sore throat I’d had in early March was actually COVID-19, edging around the idea I’d infected somebody else and killed them. Watching footage of people lining up for hours hoping to get tested, while the president called the whole thing a hoax. And then — where was I? Right. Video games. Long story short, Half-Life: Alyx is a very good VR shooter about space zombies. And 30,000 people in my city are dead.  —Adi Robertson I was in Austin, Texas, profiling the eccentric brothers behind The Chive when stuff started to get really weird. It was March 11th — the World Health Organization had just declared COVID-19 a global pandemic. I remember sitting in my hotel room wondering if I’d made a big mistake. Was I going to get stuck in Texas? My editor, Kevin Nguyen, had asked me before I left if I felt comfortable traveling, and I’d answered honestly when I said yes. But now I felt really vulnerable. There was so much uncertainty — rumors that had seemed quite outlandish (they’re going to shut down air travel!) were suddenly within the realm of possibility. I bought hand sanitizer since The Chive guys were big on shaking hands.  —Zoë Schiffer The last time I went to our office was on March 3rd, the day after I wrote about how we had no idea how widely the virus was spreading because our testing was insufficient. The only reason I went was to record a Vergecast episode; I’d already decided at that point it was wisest to avoid public transit. As I did not own a car, that meant staying home. By then, I’d already panic-bought a bunch of nonperishable food items, cold medicine, and some bleach since I’d missed my Wednesday evening yoga class on February 26th to write about a possible community-acquired case in the Bay Area where I live; after that, stocking up only seemed natural. If you’re going to panic, I figured, better to panic before everyone else. At that point, I still believed the CDC was competent and any kind of shutdown would only last a month or so, the way it did in other countries. March 11th was also a Wednesday. My boyfriend and I went into our yoga class, and when we came out, Tom Hanks had been diagnosed and the NBA had canceled its season. He and I then proceeded to get into a giant fight — the only thing I was still doing was studio workout classes. He insisted, correctly, that I shouldn’t go to them anymore. Also around that time, I lost faith that the US government would do anything to prevent coronavirus from becoming widespread. We’d been reporting on this threat for months, along with a lot of other outlets, and no one was taking it seriously. What was the point of our work? I still wonder about that; I have wondered about it every time we’ve reached a new grim milestone of death. The fight I had with my boyfriend turned out to be irrelevant; the Bay Area shut down on March 16th. My yoga studio, where I’d gone four or five times a week for eight years, went out of business that summer.  —Liz Lopatto A chronological sampling of events from the day that was Wednesday, March 11. pic.twitter.com/0ez6Oi9Mgv I remember a few things very clearly about the day Philly started its lockdown. I was working at a library, and I had decided to reorganize our big supply closet. I remember leaving the closet half-organized, with little piles of folders and labels on the floor that I’d “get to tomorrow.” Turns out, tomorrow wasn’t coming. I lost that job a month later, and I have no idea if anyone ever finished up tidying. When our boss told us to head home, my co-workers and I decided to grab a few books and DVDs to entertain ourselves while we were stuck at home. There was a funny “kids in a candy shop” feeling: a bunch of library workers moseying around the stacks of an empty library, taking our pick of materials to hunker down with. I think we thought, naively in retrospect, that it might be a few weeks of working from home and then back to normal. A year later, I still have my pile of library books, tucked in a box that I use as a footrest at my desk. (Library friends, if you’re reading this, I swear I will return them eventually.) I was too terrified to take the train or a ride-share home that day, so I hitched a ride with my equally terrified partner. We stopped at a few grocery stores (no toilet paper in sight) and a liquor store on the way. There was a bottle of Corona on the shelf outfitted with the head and legs of a virus, and I stared at it for a long moment trying to decide if it was cute or horribly morbid.  —Kait Sanchez I have bad anxiety, so I stocked up on nonperishables and hand sanitizer in late February. During my last commute home from work, I didn’t have any gloves so I placed (obviously clean and unused) dog poop bags over my hands so I could hold the pole on the train. I remember people telling me I must be so relieved that my wedding was set for August 28th, and that this would all blow over by then. My parents and wedding caterer are both in upstate New York, and my partner and I were too scared of potentially spreading it to them to drive up. So my parents volunteered to go to the wedding tasting for us on March 14th. I FaceTimed them from my MacBook while they tried stuffed mushrooms, sweet and sour meatballs, and goat cheese puffs. I nodded along while I Googled “DIY sourdough starter” in the background. I am an eternal pessimist, so at that point, I had already resigned myself to having to stay home, probably forever. The wedding would obviously have to be postponed. I would never leave the house again! Therefore, my main concern, other than the crushing feeling of the world crumbling around me, was that all of my friends were showing off beautiful loaves of bread on Instagram — and I hadn’t picked up yeast during my grocery run. We decided to postpone the wedding by the end of March. My sourdough starter died a few days later. I cried when I scraped it into the trash, and then again, a week later, when I described it to my therapist over Zoom.  —Sarah Smithers The Verge has covered too many events to count in the past decade, so we were prepared to notice them crumble when COVID began to rampage across the globe. I started a simple website to track them, called Is It Canceled Yet? (I even nabbed the isitcanceledyet.com domain. Sweet.) From E3 to the Olympics, there was plenty of material to monitor. The project was mostly lighthearted and dusted lightly with humor when the cancellations were coming at a trickle and when we had some optimism that everyone would come together to shut down the spread of the virus. But then we learned our government and many of our neighbors wouldn’t take it seriously, and the trickle became a flood, and now 500,000 Americans are dead. In the span of a day or two, the Is It Canceled Yet? site became too popular and too difficult for me to manage. People started pointing to it as a serious resource for knowledge about our decaying world; literally hundreds of people were tweeting at me and emailing me asking me to add things to the list or notifying me of changes. Unable to dedicate enough of my time to make the site useful and comprehensive, Is It Canceled Yet? became just another thing that was canceled.  —T.C. Sottek I moved into my own apartment two weeks before New York locked down. It’s the first time I’ve ever lived alone in the city — a longtime dream realized after years of meticulous saving and roommates who didn’t understand the concept of chores. I spent the days immediately after my move eating pizza on the floor and wishing I never had to leave. The weeks that followed had no real shape. I remember dodging around other New Yorkers on the street to keep six feet between us when we were being told not to wear masks. That I had a healthy supply of hand sanitizer already from years of covering gaming conventions. How being out after sundown suddenly felt illicit; how being out at all felt dangerous. Dread and dark humor held hands during my unexpected isolation. One hour, I’d be crying hysterically until my eyes were nearly swollen shut; the next, I’d be giving myself a wax in the stupidest, most optimistic pastime I’ve had all quarantine. I can’t tell you much about those first weeks or even the past year. Only a few moments have left a strong impression, and they’re best saved for therapy. But to the man who sold me this monkey’s paw: you were not clear enough on the fine print. —Megan Farokhmanesh Update, March 11, 2:27 PM ET: Updated with additional blurbs. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mitchell Clark", "title": "Los Angeles movie-goers will soon be able to visit a theater for the first time in a year", "description": "LA is known as the center of the American movie industry, and next week its residents will be able to watch those movies in theaters again. The restrictions are being lifted after the county met its vaccination targets.", "url": "https://www.theverge.com/2021/3/11/22326343/los-angeles-la-movie-theaters-reopen-movie-capitol", "urlToImage": "https://cdn.vox-cdn.com/thumbor/rhLMpPsUCSnKYy1-K5SyA_8ZuTo=/0x71:1020x605/fit-in/1200x630/cdn.vox-cdn.com/assets/1153229/amc-movie-theater-logo_1020.jpg", "publishedAt": "2021-03-12T01:39:16Z", "content": "Los Angeles theaters will be allowed to reopen at 25 percent capacity next week, according to the LA Department of Public Health (via Variety). The restrictions are being lifted, almost exactly a year after they were put in place, because Los Angeles County believes it will reach the number of vaccinations required by California to move into the next phase of reopening. The movie capitol’s theater re-opening comes a few weeks after New York’s, meaning that two of the biggest movie markets will once again be uncapping their projectors. As Variety notes, this doesn’t mean that the theaters will be able to open as soon as the ban lifts — they’ve been closed for so long that they’ll have to re-hire and train staff, which could take a week or two. The theaters will also have to ensure that they can meet the safety and cleaning requirements required by California, and will have to set up a reservation system if they don’t already have one — any theater reopening will be required to have moviegoers book their seats in advance. Attendees will also be required to wear masks, and groups will have to be at least six feet apart. Theaters will also have to figure out which movies to show (a somewhat important part of the moviegoing experience), as most major releases have been pushed back to the second half of the year. The future was looking grim for movie theaters back in October, with many theater chains shutting down all their locations in the US and UK, some permanently. The picture has been looking brighter since then, with the arrival of the vaccines, and AMC said yesterday that it believes it’ll be able to weather the storm until most Americans are able to see movies again. Whether the public will rush back to movie theaters remains to be seen, as some of the year’s most anticipated films will be released side-by-side on streaming. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "Apple sues 11-year veteran MacBook designer for allegedly stealing trade secrets for a journalist", "description": "Apple is suing Simon Lancaster, a former product design architect who worked at the company for 11 years, accusing him of selling trade secrets about unreleased Apple products to a media contact in exchange for favorable coverage.", "url": "https://www.theverge.com/2021/3/11/22325827/apple-lawsuit-macbook-designer-simon-lancaster-trade-secrets-leaks", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vB6BU3UdyQtgC8thjf_ocAuZCkE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10125273/acastro_180130_1777_0005.jpg", "publishedAt": "2021-03-11T20:47:53Z", "content": "Apple is suing Simon Lancaster, a former product design architect at the company, accusing him of selling trade secrets and details on unreleased Apple products to an unnamed media correspondent. Lancaster apparently did this in hopes of gaining publicity for his next venture after leaving Apple. AppleInsider first reported on the legal filing. “Tens of thousands of Apple employees work tirelessly every day on new products, services and features in the hopes of delighting our customers and empowering them to change the world. Stealing ideas and confidential information undermines their efforts, hurting Apple and our customers,” commented Apple in a statement to The Verge. “We take very seriously this individual’s deliberate theft of our trade secrets, violation of our ethics and our policies, all for personal gain. We will do all we can to protect the innovations we hold so dear.” According to Apple’s suit, Lancaster and his correspondent began communicating in 2018 about the possibility of obtaining information; the two then spent the next year in communication. Lancaster then reportedly contacted his correspondent in spring 2019, asking him to investigate rumors of a potential Apple product that could “mean trouble for my startup.” The lawsuit also claims that Lancaster boasted to a third party shortly after that conversation that his media contact would be writing a story on his startup if it hit $1 million in funding. In October 2019, Lancaster reportedly notified his correspondent that he was planning to leave Apple, giving over secret information on Apple products and asking if they wanted “to write a story about a 12-year Apple Design Veteran leaving for an amazing startup?” The correspondent also allegedly asked Lancaster to get additional information on an unannounced project that Apple refers to as “Project X.” Lancaster then submitted his notice of resignation to Apple on October 15th, but kept chatting with his media source — the next day, they allegedly asked for specific documents they wanted Lancaster to get before he left the company. Apple also alleges that Lancaster specifically attended a meeting about “Project X” even after he had submitted his resignation notice, specifically to get more information to pass along to his media contact, despite the fact that he had been instructed by other employees not to attend. The company also claims that Lancaster used his Apple credentials to download confidential information almost up until his employment ended at midnight on November 1st, 2019. According to Apple, Lancaster logged in from an external location at 10:24PM that day — this time, to get materials that the company says would help his new employer. Lancaster started working at Apple in 2008 and spent 11 years working at the company, serving as advanced materials lead and product design architect in his final role there before leaving in 2019 to join Arris Composites, a material design company, as its head of consumer products. According to a press release announcing his switch to Arris, Lancaster worked on the 13-inch and 15-inch Macbook Pro with Touch Bar redesigns, along with “unreleased Apple products.” "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Monica Chin", "title": "The latest Windows 10 update could cause your printer to crash your PC", "description": "Users are reporting that the latest Windows 10 update is causing issues with printers from brands including Kyocera, Ricoh, and Zebra. While Microsoft looks into the issue, Reddit has generated some temporary solutions.", "url": "https://www.theverge.com/2021/3/11/22326083/windows-10-security-update-bug-printer-crash-kyocera-ricoh-zebra-microsoft", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QGTJV_lRoOjujB-i0qC0tXQCM7U=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21932510/mchin_181225_4219_0006.0.jpg", "publishedAt": "2021-03-11T23:10:22Z", "content": "The latest Windows update has been causing problems for some printer owners, according to a report from Windows Latest (via Gizmodo). Users are reporting that they’re getting a blue screen when they try to open the print dialogue from Notepad, Office, or other programs. (You know that annoyingly ambiguous error message that’s like “Your PC ran into a problem and needs to restart”? It’s that one.) Microsoft is aware that attempting to print in certain circumstances can blue screen your PC, and has listed the bug on the Windows 10 Support page. The company doesn’t appear to have issued a fix at this time. “We are presently investigating and will provide an update when more information is available,” that website currently reads. It’s not clear how widespread the issue is, but Windows Latest says it has “seen numerous reports of error popping up here and there.” The bug appears to impact multiple printer brands including Kyocera, Ricoh, and Zebra. “Have had at least 20 confirmed cases from 4 different clients already and it’s only been an hour into the day,” one reader told the publication. Windows users are complaining across Reddit as well. “This issue was confirmed across four computers,” said one Reddit user. “We just got 3 calls from clients all experiencing this same issue,” another commenter said. If you’re encountering this problem, the easiest fix is to roll back the latest Windows update. To do this, open Settings > Update & Security > Windows Update > View Update History > Uninstall Updates > Uninstall, or remove the patch manually in Command Prompt. Some Reddit users confirmed that this fixed their problem. A user claiming to be a Microsoft employee has also posted two temporary workarounds on Reddit, which commenters have confirmed to work. You can enable direct printing in the Command Prompt, or you can use the Compatibility Administrator tool to apply a fix, depending on the application you’re running. Both processes are complicated, so your best bet is to go read that Reddit comment closely if you want to try them. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mitchell Clark", "title": "Go listen to Spotify’s podcast about itself that ignores the existence of iTunes", "description": "Spotify’s podcast, Spotify: A Product Story, is worth a listen for its technical details, as well as its introduction to the streaming services’ history. The podcast seems, however, to have completely ignored the existence of iTunes.", "url": "https://www.theverge.com/2021/3/11/22325780/spotify-podcast-a-product-story-streaming-music-history-itunes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bs509oGv0BMoX-fEYE_mlyRiz38=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10432237/mdoying_180308_1437_0082still.jpg", "publishedAt": "2021-03-11T22:50:08Z", "content": "Spotify is making a podcast about its own history, and the first two episodes are well worth a listen for the details on the jump from piracy to streaming, how the company decided to build its business, and the technical details of how it did so. There are also some fun interviews included, with the podcast featuring stories from Sean Parker, inventor of Napster, and Lars Ulrich of Metallica. In the podcast, the Spotify founders discuss the history of piracy in Spotify’s home country, Sweden, to give context about its development environment. It goes into the existence of Sweden’s Pirate Party, an actual political party that once held several seats in the country’s parliament. The founders also discuss how they wanted to take the ease of pirating music but make it legitimate. If talk about being easier than piracy sounds familiar, it’s probably because that was part of the pitch for the iTunes Music Store, too. It seems, for the most part, that iTunes and the iPod are pretty much completely ignored. The podcast presents music distribution as going from CD stores to Napster to Spotify. Apple and Spotify aren’t the best of friends, but it’s honestly somewhat hilarious to hear how the story completely ignores the fact that people could, in fact, buy digital music (an option that was around even before Spotify launched). Despite the lack of objectivity about the history of digital music, the technical depth alone makes it well worth a listen. The second episode (labeled 01) gets into how Spotify used the same peer-to-peer tech used by the pirates to build its legitimate music streaming service and how its approach blew people's minds at the time. Even though the story leaves some pretty important parts out, it’s still worth a listen to hear the origins of the popular music (and, obviously, podcasting) service. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mitchell Clark", "title": "Gogo’s 5G network launch has stalled due to the chip shortage", "description": "Aviation connectivity company Gogo is the latest to fall victim to the global computer chip storage, with the company reportedly pushing back the rollout of its 5G network due to the supply issues.", "url": "https://www.theverge.com/2021/3/11/22325999/gogo-5g-network-delay-chip-shortage", "urlToImage": "https://cdn.vox-cdn.com/thumbor/PKh8zxsUNnpC961aDGyl6HzpbJ4=/0x74:1020x608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/14611161/gogo-internet-logo-stock1_1020.1419980305.jpg", "publishedAt": "2021-03-11T22:10:33Z", "content": "Gogo will be delaying the rollout of its 5G network, pushing it back from 2021 to 2022. According to LightReading, the global chip shortage is to blame for the delay, though Gogo didn’t provide any direct details about how the shortage was setting it back. Gogo isn’t the only one feeling the sting of the global chip shortage: graphics cards, CPUs, and game consoles have become infamous for being in short supply, and car manufacturers are having to slow down production lines because of the supply constraint. The situation has gotten to the point where President Joe Biden has signed an executive order calling for a review of the chip supply chain. The company, known for providing in-flight Wi-Fi, had a difficult 2020: it did several rounds of layoffs, pay cuts, and furloughs, as people stopped taking flights. The company also ended up selling its commercial in-flight Wi-Fi business to a bankrupt satellite provider, which makes it slightly unclear as to what the company plans to do with its 5G network when it eventually gets it rolled out. The company still provides internet and in-flight entertainment for smaller, more business-oriented planes, so it’s possible it’ll use the network to improve that service. Gogo wasn’t immediately available to comment on its future plans for the network. The 5G network, when Gogo gets it rolled out, will be an upgrade to the company’s existing 3G cellular towers. Gogo gave up on its plans of upgrading the network to 4G with equipment from ZTE after the US government basically shut down the network equipment provider with a ban. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Microsoft says the latest Xbox Series X update fixes controller disconnect issues", "description": "March’s Xbox update includes fixes for Xbox Series X controller disconnect issues that some players have reported, according to the Xbox team’s Jason Ronald.", "url": "https://www.theverge.com/2021/3/11/22326224/microsoft-xbox-series-x-controller-disconnect-issues-march-update", "urlToImage": "https://cdn.vox-cdn.com/thumbor/uVahDVW6Ne3J1kafwwm0eaJ4cAA=/0x183:2640x1565/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21904643/twarren_xboxseriesxcontroller_VLS_3616_2_4.jpg", "publishedAt": "2021-03-11T23:26:03Z", "content": "Microsoft released a new Xbox update earlier this week that brings toggles for Auto HDR and FPS Boost and improvements to better support the new Xbox Wireless Headset. But there was another big feature that wasn’t mentioned in the official release notes: the update also fixes “many” of the Xbox Series X controller disconnect issues that have cropped up, according to the Xbox team’s Jason Ronald. Lots of Xbox news this week, but in case you missed it we released our March Xbox System Update yesterday. In addition to the new features, this release also fixes many of the controller disconnects players have reported.Keep the feedback coming.https://t.co/bltTsL6Lty Players began reporting disconnect issues with the controllers just days after the console’s launch, and you can see some of those reports in this 89-page thread on Microsoft’s support forums. In January, however, Microsoft acknowledged that it was aware of the issues and said that fixes were coming “in a future update” in a statement to The Verge. We haven’t tested the new update ourselves to see if it fixes issues that people have seen. But if you have been experiencing controller disconnects, it sounds like the new update could address them for you. Related "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Allison Johnson", "title": "T-Mobile plans to turn up 5G speed this year, cover 90 percent of Americans with fast 5G by 2024", "description": "T-Mobile says it will expand its slower Extended Range 5G to cover 97 percent of Americans by the end of 2022, and it will cover 90 percent of Americans with faster Ultra Capacity 5G by the end of 2023.", "url": "https://www.theverge.com/2021/3/11/22325857/t-mobile-5g-coverage-ultra-capacity-extended-range", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Spt1FkKP2hhthuQPwZl375zMAoE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19367783/acastro_191108_1777_t-mobile_0001.0.jpg", "publishedAt": "2021-03-11T21:49:18Z", "content": "During its virtual analyst event today, T-Mobile outlined some bold plans for expanding its 5G coverage and speeding up its current offerings. The company says that by the end of 2023, it will cover 90 percent of Americans (about 300 million) with what it calls Ultra Capacity 5G (its faster mid-band and mmWave service). It also plans to cover 97 percent of Americans (approximately 320 million) by the end of 2022 with its slower low-band 5G, which it calls Extended Range. Currently, 125 million are covered by Ultra Capacity, with Extended Range covering 287 million. Additionally, those currently covered by Ultra Capacity 5G will see an increase in average speeds from 300Mbps up to 400Mbps, thanks to additional megahertz devoted to 5G, and T-Mobile says that more speed increases are on the way. This portion of T-Mobile’s 5G service is largely based on spectrum acquired from its Sprint merger, with mid-band frequencies well-suited to faster speeds and broad coverage. Already having access to those mid-band frequencies allowed T-Mobile to take a less aggressive approach to the recent FCC C-band auction, a fact it celebrated throughout its investor call today. T-Mobile says its comparatively low bid of $9.3 billion (Verizon and AT&T bid $45.4 and $23.4 billion, respectively) went toward spectrum that would strategically supplement its current 2.5GHz holdings. Those frequencies will become available in 2023 and likely figure into the latter part of the company’s aggressive expansion plans. Correction March 11th, 4:32PM PT: Verizon and AT&T bid $45.4 and $23.4 billion respectively in the recent FCC auction. A previous version of this article said that the companies bid $45.4 and $23.4 million, which would have been quite a steal.  "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Building the ultimate retro computer", "description": "MiSTer uses field-programmable gate array (FPGA) technology to shapeshift into classic hardware, from the NES to the Neo Geo, to the Apple II or Acorn Archimedes.", "url": "https://www.theverge.com/22323002/mister-fpga-project-retro-computer-console-early-pc", "urlToImage": "https://cdn.vox-cdn.com/thumbor/t6qIn4aQemDyDWVchZ51enNKIcs=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22360562/sbyford_210303_4461_0014.jpg", "publishedAt": "2021-03-11T14:00:00Z", "content": "Although I assembled it myself, and its software all comes from an open-source DIY project, in many ways my MiSTer is the most versatile computer I own. It’s a shapeshifting wonderbox that can change its own logic to make itself run like countless other machines as accurately as possible. From old arcade boards to early PCs to vintage consoles, MiSTer developers are devoted to helping it turn into an ever-expanding range of hardware. If you’ve ever wanted to use computer software or hardware that is no longer available for sale, you’ve probably run into emulation before. It’s a huge field that often involves a ton of people working on a technically challenging feat: how to write software that lets one computer run code that was written for another. But there’s only so much traditional emulators can do. There are always inherent compromises and complexities involved in getting your current hardware to run software it was never designed to handle. Emulated operating systems or video games often encounter slowdown, latency, and bugs you’d never have encountered with the original devices. So what if there was a way to alter the hardware itself? Well, that’s MiSTer. It’s an open-source project built upon field-programmable gate array (FPGA) technology, which means it makes use of hardware that can be reconfigured after the fact. While traditional CPUs are fixed from the point of manufacture, FPGAs can be reprogrammed to work as if they came right off the conveyor belt with the actual silicon you want to use. What this means is, you’re not tricking a processor into believing it’s something else, you’re setting it up to run that way from the start. A MiSTer system can theoretically run software from the NES to the Neo Geo, to the Apple II or Acorn Archimedes, and deliver responsive, near-as-dammit accurate performance next to what you’d get from the actual devices. Of course, it’s not as easy as that makes it sound. In order to program an FPGA to act like a computer from three decades ago, you have to intimately understand the original hardware. And that’s what makes MiSTer one of the technically coolest DIY projects going today, building on the knowledge of developers around the globe. FPGAs aren’t new technology. Two early companies in the field (sorry) were Altera, now owned by Intel, and Xilinx, now part of AMD. The two have competed since the 1980s for market share in programmable logic devices, largely serving enterprise customers. One of the biggest advantages of FPGAs on an industrial scale is that companies can iterate their software design on hardware before they need to manufacture the final silicon. FPGAs are widely used to develop embedded systems, for example, because the software and the hardware can be designed near-concurrently. You might be familiar with FPGAs if you’ve come across Analogue’s boutique console clones, like the Mega Sg and the Super Nt. Those use FPGAs programmed in a certain way to replicate a single, specific piece of hardware, so you can use your original physical cartridges with them and get an experience that’s very close to the actual consoles. The MiSTer project is built around more accessible FPGA hardware than you’d find in commercial or enterprise applications. The core of the system is an FPGA board called the DE10-Nano, produced by another Intel-owned company called Terasic that’s based out of Taiwan. It was originally intended for students as a way to teach themselves how to work with FPGAs. The DE10-Nano looks somewhat similar to a Raspberry Pi — it’s a tiny motherboard that ships without a case and is designed to be expanded. The hardware includes an Altera Cyclone V with two ARM Cortex-A9 CPU cores, 1GB of DDR3 SDRAM, an HDMI out, a microSD card slot, a USB-A port, and Ethernet connectivity. It runs a Linux-based OS out of the box and sells for about $135, or $99 to students. MiSTer is inspired by MiST, an earlier project that made use of an Altera FPGA board to recreate the Atari ST. But the DE10-Nano is cheaper, more powerful, and expandable, which is why project leader Alexey Melnikov used it as the basis for MiSTer when development started a few years back. Melnikov also designed MiSTer-specific daughterboards that enhance the DE10-Nano’s capability and make a finished machine a lot more versatile; the designs are open-source, so anyone is free to manufacture and sell them. Detail shots of the DE10-Nano. You can run MiSTer on a single DE10-Nano, but it’s not recommended, because the board alone will only support a few of the cores available. (A “core” is a re-creation of a specific console or computer designed to run on the MiSTer platform.) The one upgrade that should be considered essential is a 128MB stick of SDRAM, which gives MiSTer enough memory at the right speed to run anything released for the platform to date. Beyond that, you’ll probably want a case, assuming you’d rather not run open circuitry exposed to the elements. There are various case designs available, many of which are intended for use with other MiSTer-specific add-ons that vertically attach to the DE10-Nano. An I/O board isn’t necessary for most cores, for example, but it adds a VGA port along with digital and analog audio out, which is useful for various setups. (A lot of MiSTer users prefer to hook up their systems to CRT TVs to make the most of the authentic output and low latency.) You can add a heatsink or a fan, which can be a good idea if you want to run the system for extended periods of time. And there’s a USB hub board that adds seven USB-A ports. For my setup, I ordered the DE10-Nano, a 128MB SDRAM stick, a VGA I/O board with a fan, a USB hub board, and a case designed for that precise selection of hardware. These largely came from different sources and took varying amounts of time to show up; you can order the DE10-Nano from countless computer retailers, but other MiSTer accessories involve diving into a cottage industry of redesigns and resellers. Half of my parts arrived in a battered box from Portugal filled with shredded paper and loosely attached bubble wrap. MiSTer accessories are based on Melnikov’s original designs, but since the project is open-source, many sellers customize their own versions. My case, for example, includes a patch cable that hooks directly into the I/O board to control its lighting, while some others require you to route the LEDs yourself. The USB board, meanwhile, came with a bridge to the DE10-Nano that seemed to be a different height from most others, which meant I had to improvise a little with screw placements. Nothing I ordered came with instructions, so it did take some time to figure out what should go where, but everything worked fine in the end. The only other thing I had to do was go buy a small hex screwdriver for the final screws in the case. That’s part of the fun with MiSTer. There’s a base specification that everything works around, but you’re still ultimately assembling your own FPGA computer, and you can adjust the build as much or as little as you want. Related Once your hardware is set, you need to install the MiSTer software. There are a few ways to do this, and you’ll want to dig around forums and GitHub for a while so you know what you’re doing, but the method I went with was simple in the end — essentially, you format your microSD card with an installer package, put it into the DE10-Nano, plug in an Ethernet cable and a USB keyboard, power on the system, and it’ll download all of the available cores. Your SD card will then be set up to boot the MiSTer OS directly, and you can run another script to make sure everything’s updated with the most recent versions. The MiSTer OS is very simple, with a default background that looks like pixelated TV static and a basic menu in a monospaced font that lets you select from lists of console and computer cores. The first thing I did was load some old Game Boy Advance ROMs I dumped well over a decade ago, because for some reason Nintendo doesn’t want to sell them for the Switch. (Please sell them for the Switch, Nintendo.) The performance felt about as authentic as I could’ve expected, except for the fact that I was looking at a 4K TV instead of a tiny screen. My main reason for getting into MiSTer is to have a hardware-based way to access the parts of computer history that I missed, or to revisit forgotten platforms that I was around for. I knew that computer systems like the Apple II and the Amiga were big gaps in my knowledge, so it’s great to have a little box that can run like either of them on command. I’ve also been getting into the MSX platform, which was popular in Japan in the ’80s. My next rainy-day project is to work on an install of RISC OS, the Acorn operating system that was on the first computers I ever used at school in the UK. (You can actually still buy licensed ROM copies of various versions of the OS, which was a neat surprise.) MiSTer development is a vibrant scene. Melnikov has a Patreon that’s updated several times a week with improvements he’s made to various cores, but there are lots of other people contributing to the project on a daily or weekly basis. A colleague introduced me to the work of Jose Tejada, for example, who’s based in Spain and has made a ton of progress on replicating old Capcom arcade machine boards. There’s another project aiming to get the original PlayStation running, marking the biggest step yet into 3D hardware on MiSTer. FPGAs are often talked about as if they’re a silver bullet for perfect emulation, but that’s really not the case — at least, not without a lot of effort. Anything that runs perfectly on MiSTer, or as close to perfectly as is otherwise imperceptible, is the result of a ton of work by talented programmers who have spent time figuring out the original hardware and applying the knowledge to their cores. Just read this post from the FPGA PSX Project about what it took to get Ridge Racer running on MiSTer, as well as the assessment of how far they have to go. The cores can vary in quality, accuracy, and state of completion, but a lot of them are still under active development and huge strides have been made in the past couple of years. Analogue lead hardware engineer Kevin Horton spoke to The Verge in 2019 about the work that went into re-creating the Sega Genesis for the Mega Sg console. The process took him nine months, including two-and-a-half months figuring out the CPU at the heart of the console. “I didn’t know Genesis very well, and knew literally nothing about the 68000 CPU at all!” he said. “This was my first foray into both things and probably slowed the process down since I had to learn it all as I went.” Ultimately, Horton confirmed the accuracy of his work by directly connecting a 68000 to an FPGA and comparing their performance on a test that ran for a week straight. It demonstrates the lengths that FPGA enthusiasts go to in pursuit of the most accurate results possible, but what makes MiSTer special is that this is largely the work of hobbyists. No one’s paying anyone a salary to make incremental tweaks to the performance of the arcade version of Bionic Commando, but that’s where Tejada has directed his passion. MiSTer is an important project because it speaks to the concept of preservation in a way that all too often goes underserved by the technology industry. The project makes the argument that the way we run software is as big a part of our experience as its content. Yes, you can port or emulate or re-release software to run on modern hardware, but there’s always going to be a compromise in the underlying code that moves the pixels in front of your eyes. Of course, that might sound like a pretty niche concern for anyone who’s satisfied with, say, the emulated software you can run in a browser at Archive.org. I’m often one of those people myself — emulation can be great, and it’s hard to beat the convenience. But the MiSTer project is an incredible effort all the same. I’ll never have a shred of the technical knowledge possessed by MiSTer developers, but I’m grateful for their effort. Once you build your own system, it’s hard not to feel invested in the work that goes into it; MiSTer is a never-ending pursuit of perfection, and there’s something beautiful about that. Photography by Sam Byford / The Verge "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "James Vincent", "title": "Facebook’s next big AI project is training its machines on users’ public videos", "description": "Facebook has announced a new AI project called Learn From Video, which will use public Facebook videos to train its machine learning models. The company is vague about future applications, but it says such models could be used to improve captions, search func…", "url": "https://www.theverge.com/2021/3/12/22326975/facebook-training-ai-public-videos-digital-memories", "urlToImage": "https://cdn.vox-cdn.com/thumbor/0nPZ5hv8HUuyc6owSywrNjlcIIA=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9441049/acastro_171002_1777_0004_v1.jpg", "publishedAt": "2021-03-12T17:00:00Z", "content": "Teaching AI systems to understand what’s happening in videos as completely as a human can is one of the hardest challenges — and biggest potential breakthroughs — in the world of machine learning. Today, Facebook announced a new initiative that it hopes will give it an edge in this consequential work: training its AI on Facebook users’ public videos. Access to training data is one of the biggest competitive advantages in AI, and by collecting this resource from millions and millions of their users, tech giants like Facebook, Google, and Amazon have been able to forge ahead in various areas. And while Facebook has already trained machine vision models on billions of images collected from Instagram, it hasn’t previously announced projects of similar ambition for video understanding. “By learning from global streams of publicly available videos spanning nearly every country and hundreds of languages, our AI systems will not just improve accuracy but also adapt to our fast moving world and recognize the nuances and visual cues across different cultures and regions,” said the company in a blog. The project, titled Learning from Videos, is also part of Facebook’s “broader efforts toward building machines that learn like humans do.” The resulting machine learning models will be used to create new content recommendation systems and moderation tools, says Facebook, but could do so much more in the future. AI that can understand the content of videos could give Facebook unprecedented insight into users’ lives, allowing them to analyze their hobbies and interests, preferences in brands and clothes, and countless other personal details. Of course, Facebook already has access to such information through its current ad-targeting operation, but being able to parse video through AI would add an incredibly rich (and invasive) source of data to its stores. Facebook is vague about its future plans for AI models trained on users’ videos. The company told The Verge such models could be put to a number of uses, from captioning videos to creating advanced search functions, but did not answer a question on whether or not they would be used to collect information for ad-targeting. Similarly, when asked if users had to consent to having their videos used to train Facebook’s AI or if they could opt out, the company responded only by noting that its Data Policy says users’ uploaded content can be used for “product research and development.” Facebook also did not respond to questions asking exactly how much video will be collected for training its AI systems or how access to this data by the company’s researchers will be overseen. In its blog post announcing the project, though, the social network did point to one future, speculative use: using AI to retrieve “digital memories” captured by smart glasses. Facebook plans to release a pair of consumer smart glasses sometime this year. Details about the device are vague, but it’s likely these or future glasses will include integrated cameras to capture the wearer’s point of view. If AI systems can be trained to understand the content of video, then it will allow users to search for past recordings, just as many photo apps allow people to search for specific locations, objects, or people. (This is information, incidentally, that has often been indexed by AI systems trained on user data.) As recording video with smart glasses “becomes the norm,” says Facebook, “people should be able to recall specific moments from their vast bank of digital memories just as easy as they capture them.” It gives the example of a user conducting a search with the phrase “Show me every time we sang happy birthday to Grandma,” before being served relevant clips. As the company notes, such a search would require that AI systems establish connections between types of data, teaching them “to match the phrase ‘happy birthday’ to cakes, candles, people singing various birthday songs, and more.” Just like humans do, AI would need to understand rich concepts comprised of different types of sensory input. Looking to the future, the combination of smart glasses and machine learning would enable what’s referred to as “worldscraping” — capturing granular data about the world by turning wearers of smart glasses into roving CCTV cameras. As the practice was described in a report last year from The Guardian: “Every time someone browsed a supermarket, their smart glasses would be recording real-time pricing data, stock levels and browsing habits; every time they opened up a newspaper, their glasses would know which stories they read, which adverts they looked at and which celebrity beach pictures their gaze lingered on.” This is an extreme outcome and not an avenue of research Facebook says it’s currently exploring. But it does illustrate the potential significance of pairing advanced AI video analysis with smart glasses — which the social network is apparently keen to do. By comparison, the only use of its new AI video analysis tools that Facebook is currently disclosing is relatively mundane. Along with the announcement of Learning from Videos today, Facebook says it’s deployed a new content recommendation system based on its video work in its TikTok-clone Reels. “Popular videos often consist of the same music set to the same dance moves, but created and acted by different people,” says Facebook. By analyzing the content of videos, Facebook’s AI can suggest similar clips to users. Such content recommendation algorithms are not without potential problems, though. A recent report from MIT Technology Review highlighted how the social network’s emphasis on growth and user engagement has stopped its AI team from fully addressing how algorithms can spread misinformation and encourage political polarization. As the Technology Review article says: “The [machine learning] models that maximize engagement also favor controversy, misinformation, and extremism.” This creates a conflict between the duties of Facebook’s AI ethics researchers and the company’s credo of maximizing growth. Facebook isn’t the only big tech company pursuing advanced AI video analysis, nor is it the only one to leverage users’ data to do so. Google, for example, maintains a publicly accessible research dataset containing 8 million curated and partially labeled YouTube videos in order to “help accelerate research on large scale video understanding.” The search giant’s ad operations could similarly benefit from AI that understands the content of videos, even if the end result is simply serving more relevant ads in YouTube. Facebook, though, thinks it has one particular advantage over its competitors. Not only does it have ample training data, but it’s pushing more and more resources into an AI method known as self-supervised learning. Usually, when AI models are trained on data, those inputs have be to labeled by humans: tagging objects in pictures or transcribing audio recordings, for example. If you’ve ever solved a CAPTCHA identifying fire hydrants or pedestrian crossing then you’ve likely labeled data that’s helped to train AI. But self-supervised learning does away with the labels, speeding up the training process, and, some researchers believe, resulting in deeper and more meaningful analysis as the AI systems teach themselves to join the dots. Facebook is so optimistic about self-supervised learning it’s called it “the dark matter of intelligence.” The company says its future work on AI video analysis will focus on semi- and self-supervised learning methods, and that such techniques “have already improved our computer vision and speech recognition systems.” With such an abundance of video content available from Facebook’s 2.8 billion users, skipping the labeling part of AI training certainly makes sense. And if the social network can teach its machine learning models to understand video seamlessly, who knows what they might learn? "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Microsoft’s Edge browser will match Chrome’s upcoming four-week release cycle", "description": "Microsoft is going to adjust its release cycles for Microsoft Edge to match Google’s every-four-weeks release cadence for Chrome announced earlier this week. The change will go into effect with Edge 94, which is targeted for a September release.", "url": "https://www.theverge.com/2021/3/12/22327832/microsoft-edge-browser-google-chrome-release-cycle", "urlToImage": "https://cdn.vox-cdn.com/thumbor/h2TNhqf8u7_lV8mmNRHNxi4G-H0=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19713463/acastro_200207_3900_Edge_0001.0.jpg", "publishedAt": "2021-03-12T19:32:17Z", "content": "Microsoft is going to adjust its release cycles for Microsoft Edge to match the every-four-weeks release cadence for Chrome that Google announced last week. “As contributors to the Chromium project, we look forward to the new 4-week major release cycle cadence that Google announced to help deliver that innovation to our customers even faster,” Microsoft said in a blog post on Friday. The change will go into effect with Edge 94, which is targeted for a September release. Google has committed to making the switch with Chrome in Q3 with Chrome 94, but hasn’t given a specific month like Microsoft has. Like Google, Microsoft is also offering enterprises the option of a longer release cycle. On that Extended Stable schedule, there will be a new release every eight weeks. However, a four-week cadence will be the default, Microsoft says. Edge isn’t the only Chromium-based browser making the switch to a four-week release cycle; Brave told The Verge on March 5th that it plans to match the new schedule as well. Related "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Taylor Lyles", "title": "Apple’s MagSafe Duo charger is down to its lowest price yet at Best Buy", "description": "Best Buy has slashed $29 off the usual price of the MagSafe Duo Charger. Normally $129, you can get Apple’s 2-in-1 charger for only $100 today at the retailer.", "url": "https://www.theverge.com/good-deals/2021/3/11/22325027/apple-magsafe-duo-charger-watch-sport-samsung-galaxy-buds-live-deal-sale", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9AE4OpidCwPyeQD79ba6TYS9l3A=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22024810/dbohn_201109_4283_0004.0.jpg", "publishedAt": "2021-03-11T15:36:01Z", "content": "At $129, Apple’s MagSafe Duo charger is an expensive accessory. But if you are looking to buy this charger at a more reasonable price, Best Buy has knocked $29 off the MagSafe Duo today, bringing the price down to $100. The MagSafe duo is a 2-in-1 charger that allows you to wirelessly charge select iPhones, Apple Watches, certain AirPods wireless charging cases, and other Qi-certified devices. If you plan to buy this charger, keep in mind that it does not include a USB-C charging brick, which you will need to buy separately. Prices taken at time of publishing. Apple’s 2-in-1-style charger, which includes a MagSafe charger on one side and an Apple Watch charger on the other side. If you’re an Apple Watch owner who has either a 40mm or 44mm model and you are looking to buy a new loop for your wearable, you’re in luck. Daily Steals is offering Verge readers the opportunity to buy an Apple Watch Sport Loop in select colors for only $18 with code VERGEAPL applied at checkout. We think this is a good deal for a few reasons, most notably because these are Apple-branded Sport Loops, which normally retail for $49 on Apple’s direct website. Additionally, a few colors are not available on Apple’s website that Daily Steals has available, such as a Pride-themed Sport Loop. These Sport Loops also include a one-year warranty through Apple. It’s worth noting, though, that there are more options for the 44mm-sized Apple Watch models than 40mm. This promotional code only applies to one strap in your cart, so if you buy more than one, the code will only adjust the price for one unit. However, we had luck getting this deal twice with two separate transactions. Prices taken at time of publishing. Sport Loops that pair with the Apple Watch. Verge readers can get one Sport Loop from Daily Steals for only $18 with promo code VERGEAPL applied at checkout. Best Buy knocked down the price of a refurbished pair of Samsung Galaxy Buds Live to $80. If you are apprehensive about buying refurbished products, Woot is currently selling a brand-new pair of Samsung’s bean-shaped wireless earbuds in black for only $105, while supplies last. Prices taken at time of publishing. Samsung’s unconventional wireless earbuds are shaped like beans, but they produce a powerful sound and come with lengthy battery life. Subscribe to get the best Verge-approved tech deals of the week. "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Barbara Krasnoff", "title": "How to create a signature for PDF documents on a PC", "description": "While Windows doesn’t offer a built-in PDF signing feature , there are third-party apps that you can use such as Adobe Acrobat Reader DC, which is Adobe’s free PDF reader.", "url": "https://www.theverge.com/22323097/pdf-signature-windows-pc-adobe-how-to", "urlToImage": "https://cdn.vox-cdn.com/thumbor/EF9c-euDZrPQ9_ZeEhCLhV_aZLU=/0x184:2640x1566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21953652/twarren-surfacelaptopgo-7.0.jpg", "publishedAt": "2021-03-11T14:52:46Z", "content": "Even before the COVID-19 pandemic closed most offices, more and more official papers were being turned into PDF documents. (PDF stands for Portable Document Format; it is a standard created by Adobe in the early 1990s that allows paper documents to be turned into exact digital copies.) These days, hard copy paperwork is fast becoming the exception rather than the rule. However, even digital documents have to be signed. You can do it the long way — print those documents out, sign them, and then scan them back into your computer — or you can create a digital signature and place it directly on the PDF. Unfortunately, while Windows doesn’t offer a built-in PDF signing feature the way a Mac does, there are third-party apps you can download that will give you the same ability. In this case, I’m using Adobe Acrobat Reader DC, which is Adobe’s free PDF reader. Here’s how to set it up and use it to sign your PDF documents. And you’re done! Now, if you want to add your signature to a PDF, just open your document using Adobe Acrobat Reader and click on the “Sign” icon. You can then select your saved signature and place it where you need it on your PDF document. Adobe Acrobat Reader DC is, of course, not the only app that you can use to read and / or edit a PDF document. There are a variety of other apps out there with free versions that will let you do basic PDF work, such as HelloSign, Smallpdf, and Docsketch. However, most of those free versions come with limitations — for example, both HelloSign and Docsketch let you sign up to three documents a month, while Smallpdf lets you process up to two documents per day. Adobe Reader doesn’t have any limitations on your ability to sign documents, but if you want to create a PDF, or export it to another format, you’ll have to get the Pro version. Related "}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Kim Lyons", "title": "These new 3D-printed homes in Austin are going for $450K", "description": "ICON used its massive Vulcan 3D printer to create the first floors of four houses in East Austin, Texas. Each of the houses is between 1,000 and 2,000 square feet.", "url": "https://www.theverge.com/2021/3/11/22325004/new-3d-printed-homes-austin-price-icon-housing", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9xeaC9R8hM5uj8x9qY_E-aTygAI=/0x51:2500x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22362522/3Strands_and_ICON_3D_Printed_Homes_AustinTX_2021_Exterior_2_Credit_LoganArchitecture.jpeg", "publishedAt": "2021-03-11T16:09:00Z", "content": "When it showed off its 3D-printed homes at the South by Southwest festival back in 2018, Austin-based construction technology company ICON told The Verge its Vulcan printer could create an 800-square-foot structure for about $10,000. It seemed like only a matter of time before higher-end 3D-printed homes became a reality. Now, a new development in East Austin is selling four houses built using ICON’s technology, starting at $450,000 (roughly the median home price in Austin at present). To be clear, ICON 3D-printed the first floor of each of the two- to four-bedroom homes in the new East 17th Street Residences development; the upper floors were built using conventional construction. They’ll be ready for move-in this summer. Watching the gigantic printer spit out what turns into a house is pretty mesmerizing. The houses were designed by Austin-based firm Logan Architecture, and the developer on the project is 3Strands of Kansas City. “We want to change the way we build, own and how we live in community together,” 3Strands CEO Gary O’Dell said in a statement. “This project represents a big step forward, pushing the boundaries of new technologies.” Each of the houses took between five and seven days of printing time, and they’re between 1,000 and 2,000 square feet. The material used in the 3D-printing process is “a proprietary cementitious material called Lavacrete,” according to ICON, which it says is more durable than traditional construction materials. So far, ICON has printed two dozen houses and structures across the US and Mexico, most of which are inhabited, including seven houses the company 3D-printed last year to house homeless people at Community First Village in Austin. Although it’s touting the East 17th Street houses as the first 3D-printed homes for sale, The Architect’s Newspaper notes that ICON may not be the first to produce 3D-printed homes for the commercial real estate market. Long Island-based SQ4D claimed last month that it had the first “permitted” 3D-printed house in the US, a single-family residence in Riverhead, New York, listed at $300,000. In addition to building its 3D-printed structures on planet Earth, ICON is working with NASA on research and development of a space-based construction system, with the ultimate goal of putting buildings on the Moon and Mars.        "}]